In [75]:
import pandas as pd
from pathlib import Path

data_path = Path('data/performance.csv')

# 파일이 없으면 상위 디렉토리에서 시도
if not data_path.exists():
    data_path = Path('src/data/performance.csv')

# 데이터 로드
df = pd.read_csv(data_path,encoding='utf8')
df

,GENDER,TEAM,EDUCATION,TRAINING,ACHIEVEMENT,ABILITY,ATTITUDE
0,female,B,bachelor's degree,none,72,72,74
1,female,C,some college,completed,69,90,88
2,female,B,master's degree,none,90,95,93
3,male,A,associate's degree,none,47,57,44
4,male,C,some college,none,76,78,75
...,...,...,...,...,...,...,...
995,female,E,master's degree,completed,88,99,95
996,male,C,high school,none,62,55,55
997,female,C,high school,completed,59,71,65
998,female,D,some college,completed,68,78,77
999,female,D,some college,none,77,86,86

In [76]:
df.tail()

     GENDER TEAM        EDUCATION   TRAINING  ACHIEVEMENT  ABILITY  ATTITUDE
995  female    E  master's degree  completed           88       99        95
996    male    C      high school       none           62       55        55
997  female    C      high school  completed           59       71        65
998  female    D     some college  completed           68       78        77
999  female    D     some college       none           77       86        86

In [83]:
df.columns

Index(['GENDER', 'TEAM', 'EDUCATION', 'TRAINING', 'ACHIEVEMENT', 'ABILITY',
       'ATTITUDE'],
      dtype='object')

In [81]:
df.shape

(1000, 7)

In [84]:
df["TEAM"]

0      B
1      C
2      B
3      A
4      C
      ..
995    E
996    C
997    C
998    D
999    D
Name: TEAM, Length: 1000, dtype: object

In [86]:
df['TEAM'].unique()

array(['B', 'C', 'A', 'D', 'E'], dtype=object)

In [87]:
df.shape

(1000, 7)

In [88]:
# 다음 리스트에서 판다스에서 unique 함수에 해당하는 기능을 구현하시오.
# 파이썬 기초 문법만 활용
team = ["A", "B", "C", "D", "D", "A", "B", "C", "A"]
res = ["A", "B", "C", "D"]

# 중복 제거
unique_team = list(set(team))
print(unique_team)

['B', 'A', 'C', 'D']

In [96]:
# 새로운 열/변수 추가
df["TOTAL_SCORE"] =df['ACHIEVEMENT'] + df['ABILITY'] + df['ATTITUDE']
df

,GENDER,TEAM,EDUCATION,TRAINING,ACHIEVEMENT,ABILITY,ATTITUDE,TOTAL_SCORE
0,female,B,bachelor's degree,none,72,72,74,218
1,female,C,some college,completed,69,90,88,247
2,female,B,master's degree,none,90,95,93,278
3,male,A,associate's degree,none,47,57,44,148
4,male,C,some college,none,76,78,75,229
...,...,...,...,...,...,...,...,...
995,female,E,master's degree,completed,88,99,95,282
996,male,C,high school,none,62,55,55,172
997,female,C,high school,completed,59,71,65,195
998,female,D,some college,completed,68,78,77,223
999,female,D,some college,none,77,86,86,249

In [94]:
# 기존 열/변수 삭제
df = df.drop(['TOTAL_SCORE'],axis='columns')
df

,GENDER,TEAM,EDUCATION,TRAINING,ACHIEVEMENT,ABILITY,ATTITUDE
0,female,B,bachelor's degree,none,72,72,74
1,female,C,some college,completed,69,90,88
2,female,B,master's degree,none,90,95,93
3,male,A,associate's degree,none,47,57,44
4,male,C,some college,none,76,78,75
...,...,...,...,...,...,...,...
995,female,E,master's degree,completed,88,99,95
996,male,C,high school,none,62,55,55
997,female,C,high school,completed,59,71,65
998,female,D,some college,completed,68,78,77
999,female,D,some college,none,77,86,86

In [98]:
df[['TEAM','TOTAL_SCORE']]

    TEAM  TOTAL_SCORE
0      B          218
1      C          247
2      B          278
3      A          148
4      C          229
..   ...          ...
995    E          282
996    C          172
997    C          195
998    D          223
999    D          249

[1000 rows x 2 columns]

In [ ]:
# data frame 과 data Series 
df['ABILITY']
df[['ABILITY']]

TEAM
C    319
D    262
B    190
E    140
A     89
Name: count, dtype: int64

In [8]:
df.describe()

       ACHIEVEMENT      ABILITY     ATTITUDE
count   1000.00000  1000.000000  1000.000000
mean      66.08900    69.169000    68.054000
std       15.16308    14.600192    15.195657
min        0.00000    17.000000    10.000000
25%       57.00000    59.000000    57.750000
50%       66.00000    70.000000    69.000000
75%       77.00000    79.000000    79.000000
max      100.00000   100.000000   100.000000

In [9]:
x72over = df[df['ACHIEVEMENT']>72]
x72over

     GENDER TEAM         EDUCATION   TRAINING  ACHIEVEMENT  ABILITY  ATTITUDE
2    female    B   master's degree       none           90       95        93
4      male    C      some college       none           76       78        75
6    female    B      some college  completed           88       95        92
13     male    A      some college  completed           78       72        70
16     male    C       high school       none           88       89        86
..      ...  ...               ...        ...          ...      ...       ...
984  female    C  some high school       none           74       75        82
987    male    E  some high school  completed           81       75        76
990    male    E       high school  completed           86       81        75
995  female    E   master's degree  completed           88       99        95
999  female    D      some college       none           77       86        86

[347 rows x 7 columns]